zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_clock.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

#define CLOCK_MUX_DC_REG(mux, dc) (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_DC_0)) + (mux)*0x40U + (dc)*4U)))
#define CLOCK_MUX_CSS_REG(mux)    (*((volatile uint32_t *)((uint32_t)(&(MC_CGM->MUX_0_CSS)) + (mux)*0x40U)))

/* Pcfs settings that are dependent on device */
#define CLOCK_IP_DYNAMIC_IDD_CHANGE 2360U /* microA per MHz */
#define CLOCK_IP_A_MAX_SIZE         4U
static const uint32_t AMax[CLOCK_IP_A_MAX_SIZE]     = {5U, 10U, 150U, 200U};
static const uint32_t PcfsRate[CLOCK_IP_A_MAX_SIZE] = {12U, 48U, 112U, 184U};
/*******************************************************************************
 * Variables
 *****************************************************************************/
volatile uint32_t g_xtal0Freq         = 0U;
volatile uint32_t g_emacRmiiTxClkFreq = 0U;
volatile uint32_t g_emacRxClkFreq     = 0U;

/*******************************************************************************
 * Functions
 *****************************************************************************/

status_t CLOCK_EnableClock(clock_ip_name_t clk)
{
    uint32_t bitMask = 1UL << MC_ME_COFB_CLKEN_BIT(clk);

    assert(clk != 0U);

    /* Enable the clock only if not enabled. */
    if ((MC_ME_COFB_STAT_REG(clk) & bitMask) == 0U)
    {
        MC_ME_COFB_CLKEN_REG(clk) |= bitMask;                    /* Turn on clock. */
        MC_ME_PRTN_PCONF_REG(clk) |= MC_ME_PRTN0_PCONF_PCE_MASK; /* Trun on clock for the partition. */
        MC_ME_PRTN_PUPD_REG(clk) |= MC_ME_PRTN0_PUPD_PCUD_MASK;  /* Enable partition clock update. */

        CLOCK_McmeEnterKey();

#if (CLOCK_RETRY_TIMES != 0U)
        uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
        while (MC_ME_PRTN_PUPD_REG(clk) & MC_ME_PRTN0_PUPD_PCUD_MASK)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }
    }
    else
    {
        /* Already enabled. */
    }

    return kStatus_Success;
}

status_t CLOCK_DisableClock(clock_ip_name_t clk)
{
    uint32_t bitMask = 1UL << MC_ME_COFB_CLKEN_BIT(clk);

    assert(clk != 0U);

    /* Disable the clock only if enabled. */
    if ((MC_ME_COFB_STAT_REG(clk) & bitMask) != 0U)
    {
        MC_ME_COFB_CLKEN_REG(clk) &= ~bitMask;                  /* Turn off  clock. */
        MC_ME_PRTN_PUPD_REG(clk) |= MC_ME_PRTN0_PUPD_PCUD_MASK; /* Enable partition clock update. */

        CLOCK_McmeEnterKey();
#if (CLOCK_RETRY_TIMES != 0U)
        uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
        while (MC_ME_PRTN_PUPD_REG(clk) & MC_ME_PRTN0_PUPD_PCUD_MASK)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }
    }
    else
    {
        /* Already disabled, nothing to do. */
    }
    
    return kStatus_Success;
}

status_t CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divider)
{
    if (0U == divider)
    {
        CLOCK_TUPLE_DIV_DC_REG(div_name) &= ~MC_CGM_MUX_0_DC_0_DE_MASK;
    }
    else
    {
        CLOCK_TUPLE_DIV_DC_REG(div_name) = MC_CGM_MUX_0_DC_0_DE_MASK | ((divider - 1U) << MC_CGM_MUX_0_DC_0_DIV_SHIFT);

#if (CLOCK_RETRY_TIMES != 0U)
        uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
        /* Check update finished. */
        while ((CLOCK_TUPLE_DIV_UPD_STAT_REG(div_name) & MC_CGM_MUX_0_DIV_UPD_STAT_DIV_STAT_MASK) != 0U)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
    }
    return kStatus_Success;
}

status_t CLOCK_SetFircDiv(clock_firc_div_t divider)
{
    status_t ret = kStatus_Success;
    if ((CONFIGURATION->CONFIG_REG_GPR & CONFIGURATION_CONFIG_REG_GPR_APP_CORE_ACC_MASK) ==
        CONFIGURATION_CONFIG_REG_GPR_APP_CORE_ACC(0x5U))
    {
        CONFIGURATION->CONFIG_REG_GPR =
            (CONFIGURATION->CONFIG_REG_GPR & ~CONFIGURATION_CONFIG_REG_GPR_FIRC_DIV_SEL_MASK) |
            CONFIGURATION_CONFIG_REG_GPR_FIRC_DIV_SEL((uint32_t)divider);
    }
    else
    {
        ret = kStatus_Fail;
    }
    return ret;
}

status_t CLOCK_AttachClk(clock_attach_id_t connection)
{
    uint32_t mux = (connection & 0xFF00U) >> 8U;
    uint32_t src = connection & 0xFFU;

    assert(mux < 12U);

#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif

    if ((mux != 5U) && (mux != 6U) && (mux != 11U)) /* For hardware-controlled clock multiplexer. */
    {
        while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SWIP_MASK) != 0)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
        CLOCK_TUPLE_MUX_CSC_REG(connection) = (src << MC_CGM_MUX_0_CSC_SELCTL_SHIFT) | MC_CGM_MUX_0_CSC_CLK_SW_MASK;
#if (CLOCK_RETRY_TIMES != 0U)
        waitTimes = CLOCK_RETRY_TIMES;
#endif
        while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_CLK_SW_MASK) == 0)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
#if (CLOCK_RETRY_TIMES != 0U)
        waitTimes = CLOCK_RETRY_TIMES;
#endif
        while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SWIP_MASK) != 0)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
    }
    else /* For software-controlled clock multiplexer. */
    {
        if (src == 0xFFU)
        {
            CLOCK_TUPLE_MUX_CSC_REG(connection) = MC_CGM_MUX_5_CSC_CG_MASK;
        }
        else
        {
            CLOCK_TUPLE_MUX_CSC_REG(connection) = MC_CGM_MUX_5_CSC_SELCTL(src);
        }
    }

    return kStatus_Success;
}

/* ProgressiveClockFrequencySwitch */
status_t CLOCK_ProgressiveClockFrequencySwitch(clock_attach_id_t connection, clock_pcfs_config_t const *config)
{
    assert(config != NULL);

    uint32_t src = connection & 0xFFU;

