zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.c
    /* Only MUX_0 supported. */
    assert(((connection & 0xFF00U) >> 8U) == 0U);

    uint32_t Finput = 0U;
    uint32_t Fsafe  = 0U;
    uint32_t Rate   = 0U;
    uint32_t Amax, i, temp1, temp2, temp3, k;

    uint32_t sdur;
    uint32_t divcInit;
    uint32_t divcRate;
    uint64_t divStartValue;
    uint32_t divEndValue;

    Finput = config->clkSrcFreq / 1000000U;
    Fsafe  = CLOCK_GetFircClkFreq() / 1000000U;

    Amax = (config->maxAllowableIDDchange * 1000000U / (Finput * CLOCK_IP_DYNAMIC_IDD_CHANGE));
    Rate = Amax;

    /* Round pcfs rate by rounding amax */
    if (Amax <= AMax[0U])
    {
        Rate = PcfsRate[0U];
    }
    else if (Amax >= AMax[CLOCK_IP_A_MAX_SIZE - 1U])
    {
        Rate = PcfsRate[CLOCK_IP_A_MAX_SIZE - 1U];
    }
    else
    {
        for (i = 1U; i < CLOCK_IP_A_MAX_SIZE; i++)
        {
            if (AMax[CLOCK_IP_A_MAX_SIZE - 1U] < Amax)
            {
                Rate = PcfsRate[i - 1U];
            }
        }
    }

    /* Calculate K by using formula k = ceil(0.5 + sqrt(0.25 - (2000 * (1 -(Finput/fsafe)) / Rate))) */

    temp1 = 256U + ((2048000 * Finput) / (Fsafe * Rate)) - (2048000 / Rate); /* * 1024. */
    temp2 = 1UL << 30U; /* The second-to-top bit is set: use 1uL<<30 for uint32 type  */
    temp3 = 0U;

    /* "one" starts at the highest power of four <= than the argument */
    while (temp2 > temp1)
    {
        temp2 = temp2 >> 2;
    }
    /* Implement sqrt from K formula by using a square-root computing in embedded C */
    while (temp2 != 0U)
    {
        if (temp1 >= (temp3 + temp2))
        {
            temp1 = temp1 - (temp3 + temp2);
            temp3 = temp3 + (temp2 << 1U);
        }

        temp3 = temp3 >> 1U;
        temp2 = temp2 >> 2U;
    }

    k = (64U + 127U + (temp3 << 2U)) >>
        7U; /* Calculated K from k = ceil(0.5 + sqrt(0.25 - (2000 * (1 -(Fi/Fsafe)) / Rate))) */

    sdur          = config->stepDuration * Fsafe;
    divcInit      = Rate * k;
    divcRate      = Rate;
    divStartValue = 999U + (((uint64_t)Rate * k * (k + 1U)) >> 1U);
    divEndValue   = (Finput * 1000U / Fsafe) - 1U;

    /* Configure pcfs registers */
    MC_CGM->PCFS_SDUR  = MC_CGM_PCFS_SDUR_SDUR(sdur);
    MC_CGM->PCFS_DIVC8 = MC_CGM_PCFS_DIVC8_RATE(divcRate) | MC_CGM_PCFS_DIVC8_INIT(divcInit);
    MC_CGM->PCFS_DIVE8 = MC_CGM_PCFS_DIVE8_DIVE(divEndValue);
    assert(divStartValue <= MC_CGM_PCFS_DIVS8_DIVS_MASK);
    MC_CGM->PCFS_DIVS8 = MC_CGM_PCFS_DIVS8_DIVS((uint32_t)divStartValue);

#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SWIP_MASK) != 0)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }
    CLOCK_TUPLE_MUX_CSC_REG(connection) = (src << MC_CGM_MUX_0_CSC_SELCTL_SHIFT) | MC_CGM_MUX_0_CSC_CLK_SW_MASK |
                                          MC_CGM_MUX_0_CSC_RAMPDOWN_MASK | MC_CGM_MUX_0_CSC_RAMPUP_MASK;

#if (CLOCK_RETRY_TIMES != 0U)
    waitTimes = CLOCK_RETRY_TIMES;
#endif
    while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_CLK_SW_MASK) == 0)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }
#if (CLOCK_RETRY_TIMES != 0U)
    waitTimes = CLOCK_RETRY_TIMES;
#endif
    while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SWIP_MASK) != 0)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

status_t CLOCK_SelectSafeClock(clock_attach_id_t connection)
{
    uint32_t mux = (connection & 0xFF00U) >> 8U;
#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    if ((mux != 5U) && (mux != 6U) && (mux != 11U)) /* For hardware-controlled clock multiplexer. */
    {
        CLOCK_TUPLE_MUX_CSC_REG(connection) |= MC_CGM_MUX_0_CSC_SAFE_SW_MASK;

        while ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SAFE_SW_MASK) == 0)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
    }

    return kStatus_Success;
}

uint32_t CLOCK_GetClkSelectState(clock_attach_id_t connection)
{
    return ((CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_5_CSS_SELSTAT_MASK) >> MC_CGM_MUX_5_CSS_SELSTAT_SHIFT);
}

uint32_t CLOCK_GetClkSwitchTriggerCause(clock_attach_id_t connection)
{
    uint32_t mux     = (connection & 0xFF00U) >> 8U;
    uint32_t trigger = 0U;

    if ((mux != 5U) && (mux != 6U) && (mux != 11U)) /* For hardware-controlled clock multiplexer. */
    {
        trigger = (CLOCK_TUPLE_MUX_CSS_REG(connection) & MC_CGM_MUX_0_CSS_SWTRG_MASK) >> MC_CGM_MUX_0_CSS_SWTRG_SHIFT;
    }

    return trigger;
}

status_t CLOCK_InitFxosc(const fxosc_config_t *config)
{
    assert(config != NULL);

    CLOCK_EnableClock(kCLOCK_Fxosc);
    if ((FXOSC->STAT & FXOSC_STAT_OSC_STAT_MASK) != 0U)
    {
        FXOSC->CTRL &= ~FXOSC_CTRL_OSCON_MASK;                          /* Disable FXOSC first. */
        SDK_DelayAtLeastUs(2U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY); /*Wait for at least 2us
                                                                           before enabling FXOSC
                                                                           again. */
    }

    FXOSC->CTRL = (uint32_t)config->workMode | FXOSC_CTRL_OSCON_MASK | FXOSC_CTRL_GM_SEL(config->overdriveProtect) |
                  FXOSC_CTRL_EOCV(config->startupDelay);

#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    while ((FXOSC->STAT & FXOSC_STAT_OSC_STAT_MASK) == 0U)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    g_xtal0Freq = config->freqHz;
    return kStatus_Success;
}

#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
status_t CLOCK_InitSxosc(bool enable, uint8_t startupDelay)
{
#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    if (enable)
    {
        CLOCK_EnableClock(kCLOCK_Sxosc); /* Check and enable SXOSC clock in MC_ME. */

        SXOSC->SXOSC_CTRL &= ~SXOSC_SXOSC_CTRL_OSCON_MASK;
        SXOSC->SXOSC_CTRL &= ~SXOSC_SXOSC_CTRL_EOCV_MASK;

        SXOSC->SXOSC_CTRL = SXOSC_SXOSC_CTRL_OSCON_MASK | SXOSC_SXOSC_CTRL_EOCV(startupDelay);

