zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.c
        while ((SXOSC->SXOSC_STAT & SXOSC_SXOSC_STAT_OSC_STAT_MASK) == 0U)
        {
#if (CLOCK_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                return kStatus_Timeout;
            }
#endif
        }
    }
    else
    {
        SXOSC->SXOSC_CTRL &= ~SXOSC_SXOSC_CTRL_OSCON_MASK;
        /* CLOCK_DisableClock(kCLOCK_Sxosc); */
    }

    return kStatus_Success;
}
#endif /* FSL_FEATURE_MC_CGM_HAS_SXOSC */

status_t CLOCK_InitPll(const pll_config_t *config)
{
    uint32_t i;

    assert(config->stepSize <= 1023U);
    assert(config->stepNum <= 2047U);

    CLOCK_EnableClock(kCLOCK_Pll);

    if ((PLL->PLLCR & PLL_PLLCR_PLLPD_MASK) == 0U)
    {
        CLOCK_DeinitPll();
        SDK_DelayAtLeastUs(6U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }

    PLL->PLLDV = PLL_PLLDV_ODIV2(config->postDiv) | PLL_PLLDV_RDIV(config->preDiv) | PLL_PLLDV_MFI(config->multiplier);

    if (config->workMode == kPLL_ModeFractional)
    {
        PLL->PLLFD =
            PLL_PLLFD_SDMEN_MASK | PLL_PLLFD_SDM2_MASK | PLL_PLLFD_SDM3_MASK | PLL_PLLFD_MFN(config->fracLoopDiv);
    }
    else
    {
        PLL->PLLFD = 0U;
    }

    if (config->workMode == kPLL_ModeSSCG)
    {
        assert(config->stepSize * config->stepNum < 18432U);
        PLL->PLLFM =
            PLL_PLLFM_SPREADCTL_MASK | PLL_PLLFM_STEPNO(config->stepNum) | PLL_PLLFM_STEPSIZE(config->stepSize);
        PLL->PLLFD = PLL_PLLFD_SDMEN_MASK;
    }
    else
    {
        PLL->PLLFM = PLL_PLLFM_SSCGBYP_MASK; /* Bypass SSCG. */
    }

    PLL->PLLCAL2 &= ~PLL_PLLCAL2_ULKCTL_MASK;
    PLL->PLLCAL2 |= PLL_PLLCAL2_ULKCTL(config->accuracy);

    for (i = 0U; i < PLL_PLLODIV_COUNT; i++)
    {
        if (config->outDiv[i] != 0U)
        {
            PLL->PLLODIV[i] &= ~PLL_PLLODIV_DIV_MASK;
            PLL->PLLODIV[i] |= PLL_PLLODIV_DIV(config->outDiv[i] - 1U);
        }
        else
        {
            /* Do nonthing. */;
        }
    }

    PLL->PLLCR &= ~PLL_PLLCR_PLLPD_MASK; /* Enable PLL.*/

#if (CLOCK_RETRY_TIMES != 0U)
    uint32_t waitTimes = CLOCK_RETRY_TIMES;
#endif
    while ((PLL->PLLSR & PLL_PLLSR_LOCK_MASK) == 0U)
    {
#if (CLOCK_RETRY_TIMES != 0U)
        if (--waitTimes == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    for (i = 0U; i < PLL_PLLODIV_COUNT; i++)
    {
        if (config->outDiv[i] != 0U)
        {
            PLL->PLLODIV[i] |= PLL_PLLODIV_DE_MASK;
        }
        else
        {
            PLL->PLLODIV[i] &= ~PLL_PLLODIV_DE_MASK;
        }
    }
    return kStatus_Success;
}

uint32_t CLOCK_GetPllPhiClkFreq(uint32_t index)
{
    uint32_t freq   = 0U;
    uint32_t div    = 0U;
    uint32_t temp   = 0U;
    uint64_t temp64 = 0U;

    assert(index < PLL_PLLODIV_COUNT);

    if (((PLL->PLLCR & PLL_PLLCR_PLLPD_MASK) == 0U) && ((PLL->PLLODIV[index] & PLL_PLLODIV_DE_MASK) != 0U))
    {
        div = (PLL->PLLDV & PLL_PLLDV_RDIV_MASK) >> PLL_PLLDV_RDIV_SHIFT;
        div = (div == 0U) ? 1U : div;

        if ((PLL->PLLFD & PLL_PLLFD_SDMEN_MASK) != 0U) /* Fractional mode. */
        {
            freq   = CLOCK_GetFxoscFreq() / 1000U / div;
            temp   = (PLL->PLLDV & PLL_PLLDV_MFI_MASK) >> PLL_PLLDV_MFI_SHIFT;
            temp64 = (uint64_t)temp * 18432U + (uint64_t)(PLL->PLLFD & PLL_PLLFD_MFN_MASK);
            temp64 = temp64 * 1000U / 18432U * freq;
            assert(temp64 <= 0xFFFFFFFFU);
            freq = (uint32_t)temp64;
        }
        else
        {
            freq = CLOCK_GetFxoscFreq() * ((PLL->PLLDV & PLL_PLLDV_MFI_MASK) >> PLL_PLLDV_MFI_SHIFT) / div;
        }

        freq /= (PLL->PLLDV & PLL_PLLDV_ODIV2_MASK) >> PLL_PLLDV_ODIV2_SHIFT;
        freq /= ((PLL->PLLODIV[index] & PLL_PLLODIV_DIV_MASK) >> PLL_PLLODIV_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetFircClkFreq(void)
{
    uint32_t fircDivSel = CONFIGURATION->CONFIG_REG_GPR & CONFIGURATION_CONFIG_REG_GPR_FIRC_DIV_SEL_MASK;
    uint32_t freq       = 0U;

    switch (fircDivSel)
    {
        case CONFIGURATION_CONFIG_REG_GPR_FIRC_DIV_SEL(3U):
            freq = CLOCK_FIRC_CLK_FREQ;
            break;
        case CONFIGURATION_CONFIG_REG_GPR_FIRC_DIV_SEL(2U):
            freq = CLOCK_FIRC_CLK_FREQ / 16U;
            break;
        default:
            freq = CLOCK_FIRC_CLK_FREQ / 2U;
            break;
    }

    return freq;
}

uint32_t CLOCK_GetFxoscFreq(void)
{
    uint32_t freq = 0U;
    if ((FXOSC->STAT & FXOSC_STAT_OSC_STAT_MASK) != 0U)
    {
        freq = g_xtal0Freq;
    }
    else
    {
        freq = 0U;
    }
    return freq;
}

#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
uint32_t CLOCK_GetSxoscFreq(void)
{
    uint32_t freq = 0U;
    if ((SXOSC->SXOSC_STAT & SXOSC_SXOSC_STAT_OSC_STAT_MASK) != 0U)
    {
        freq = CLOCK_SXOSC_CLK_FREQ;
    }
    else
    {
        freq = 0U;
    }
    return freq;
}
#endif /* FSL_FEATURE_MC_CGM_HAS_SXOSC */

static inline uint32_t CLOCK_GetMux0ClkFreq(void)
{
    uint32_t freq = 0U;
    switch (MC_CGM->MUX_0_CSS & MC_CGM_MUX_0_CSS_SELSTAT_MASK)
    {
        case MC_CGM_MUX_0_CSS_SELSTAT(CLOCK_FIRC_CLK):
            freq = CLOCK_GetFircClkFreq();
            break;
        case MC_CGM_MUX_0_CSS_SELSTAT(CLOCK_PLL_PHI0_CLK):
            freq = CLOCK_GetPllPhiClkFreq(0U);
            break;
        default:
            break;
    }

    return freq;
}

uint32_t CLOCK_GetCoreClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_0 & MC_CGM_MUX_0_DC_0_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_0 & MC_CGM_MUX_0_DC_0_DIV_MASK) >> MC_CGM_MUX_0_DC_0_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetAipsPlatClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_1 & MC_CGM_MUX_0_DC_1_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_1 & MC_CGM_MUX_0_DC_1_DIV_MASK) >> MC_CGM_MUX_0_DC_1_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetAipsSlowClkFreq(void)
{
    uint32_t freq = 0U;

