zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.c
    if ((MC_CGM->MUX_0_DC_2 & MC_CGM_MUX_0_DC_2_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_2 & MC_CGM_MUX_0_DC_2_DIV_MASK) >> MC_CGM_MUX_0_DC_2_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetHseClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_3 & MC_CGM_MUX_0_DC_3_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_3 & MC_CGM_MUX_0_DC_3_DIV_MASK) >> MC_CGM_MUX_0_DC_3_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetDcmClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_4 & MC_CGM_MUX_0_DC_4_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_4 & MC_CGM_MUX_0_DC_4_DIV_MASK) >> MC_CGM_MUX_0_DC_4_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

#if defined(FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV) && (FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV != 0U)
uint32_t CLOCK_GetLbistClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_5 & MC_CGM_MUX_0_DC_5_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_5 & MC_CGM_MUX_0_DC_5_DIV_MASK) >> MC_CGM_MUX_0_DC_5_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}
#endif /* FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV */

#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
uint32_t CLOCK_GetQspiClkFreq(void)
{
    uint32_t freq = 0U;

    if ((MC_CGM->MUX_0_DC_6 & MC_CGM_MUX_0_DC_6_DE_MASK) != 0U)
    {
        freq = CLOCK_GetMux0ClkFreq();
        freq = freq / (((MC_CGM->MUX_0_DC_6 & MC_CGM_MUX_0_DC_6_DIV_MASK) >> MC_CGM_MUX_0_DC_6_DIV_SHIFT) + 1U);
    }
    else
    {
        freq = 0U;
    }

    return freq;
}
#endif /* FSL_FEATURE_CLOCK_HAS_QSPI */

uint32_t CLOCK_GetStmClkFreq(uint32_t index)
{
    uint32_t freq = 0U;
    uint32_t mux  = index + 1U;

    assert(index < 2U);

    if ((CLOCK_MUX_DC_REG(mux, 0U) & MC_CGM_MUX_1_DC_0_DE_MASK) != 0U)
    {
        switch (CLOCK_MUX_CSS_REG(mux) & MC_CGM_MUX_1_CSS_SELSTAT_MASK)
        {
            case MC_CGM_MUX_1_CSS_SELSTAT(CLOCK_FIRC_CLK):
                freq = CLOCK_GetFircClkFreq();
                break;
            case MC_CGM_MUX_1_CSS_SELSTAT(CLOCK_FXOSC_CLK):
                freq = CLOCK_GetFxoscFreq();
                break;
            case MC_CGM_MUX_1_CSS_SELSTAT(CLOCK_AIPS_PLAT_CLK):
                freq = CLOCK_GetAipsPlatClkFreq();
                break;
            default:
                break;
        }

        freq /= ((CLOCK_MUX_DC_REG(mux, 0U) & MC_CGM_MUX_1_DC_0_DIV_MASK) >> MC_CGM_MUX_1_DC_0_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

#if defined(FSL_FEATURE_CLOCK_HAS_EMAC) && (FSL_FEATURE_CLOCK_HAS_EMAC != 0U)
void CLOCK_SetEmacRmiiTxClkFreq(uint32_t freq)
{
    g_emacRmiiTxClkFreq = freq;
}

void CLOCK_SetEmacRxClkFreq(uint32_t freq)
{
    g_emacRxClkFreq = freq;
}

uint32_t CLOCK_GetEmacRxClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLOCK_MUX_DC_REG(7U, 0U) & MC_CGM_MUX_7_DC_0_DE_MASK) != 0U)
    {
        switch (CLOCK_MUX_CSS_REG(7U) & MC_CGM_MUX_7_CSS_SELSTAT_MASK)
        {
            case MC_CGM_MUX_7_CSS_SELSTAT(CLOCK_FIRC_CLK):
                freq = CLOCK_GetFircClkFreq();
                break;
            case MC_CGM_MUX_7_CSS_SELSTAT(CLOCK_EMAC_RMII_TX_CLK):
                freq = g_emacRmiiTxClkFreq;
                break;
            case MC_CGM_MUX_7_CSS_SELSTAT(CLOCK_EMAC_RX_CLK):
                freq = g_emacRxClkFreq;
                break;
            default:
                break;
        }

        freq /= ((CLOCK_MUX_DC_REG(7U, 0U) & MC_CGM_MUX_7_DC_0_DIV_MASK) >> MC_CGM_MUX_7_DC_0_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetEmacTxClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLOCK_MUX_DC_REG(8U, 0U) & MC_CGM_MUX_8_DC_0_DE_MASK) != 0U)
    {
        switch (CLOCK_MUX_CSS_REG(8U) & MC_CGM_MUX_8_CSS_SELSTAT_MASK)
        {
            case MC_CGM_MUX_8_CSS_SELSTAT(CLOCK_FIRC_CLK):
                freq = CLOCK_GetFircClkFreq();
                break;
            case MC_CGM_MUX_8_CSS_SELSTAT(CLOCK_EMAC_RMII_TX_CLK):
                freq = g_emacRmiiTxClkFreq;
                break;
            default:
                break;
        }

        freq /= ((CLOCK_MUX_DC_REG(8U, 0U) & MC_CGM_MUX_8_DC_0_DIV_MASK) >> MC_CGM_MUX_8_DC_0_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}

uint32_t CLOCK_GetEmacTsClkFreq(void)
{
    uint32_t freq = 0U;

    if ((CLOCK_MUX_DC_REG(9U, 0U) & MC_CGM_MUX_9_DC_0_DE_MASK) != 0U)
    {
        switch (CLOCK_MUX_CSS_REG(9U) & MC_CGM_MUX_9_CSS_SELSTAT_MASK)
        {
            case MC_CGM_MUX_9_CSS_SELSTAT(CLOCK_FIRC_CLK):
                freq = CLOCK_GetFircClkFreq();
                break;
            case MC_CGM_MUX_9_CSS_SELSTAT(CLOCK_FXOSC_CLK):
                freq = CLOCK_GetFxoscFreq();
                break;
            case MC_CGM_MUX_9_CSS_SELSTAT(CLOCK_PLL_PHI0_CLK):
                freq = CLOCK_GetPllPhiClkFreq(0U);
                break;
            case MC_CGM_MUX_9_CSS_SELSTAT(CLOCK_EMAC_RMII_TX_CLK):
                freq = g_emacRmiiTxClkFreq;
                break;
            case MC_CGM_MUX_9_CSS_SELSTAT(CLOCK_EMAC_RX_CLK):
                freq = g_emacRxClkFreq;
                break;
            default:
                break;
        }

        freq /= ((CLOCK_MUX_DC_REG(9U, 0U) & MC_CGM_MUX_9_DC_0_DIV_MASK) >> MC_CGM_MUX_9_DC_0_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}
#endif /* FSL_FEATURE_CLOCK_HAS_EMAC */

#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
uint32_t CLOCK_GetQspiSfckFreq(void)
{
    uint32_t freq = 0U;

    if ((CLOCK_MUX_DC_REG(10U, 0U) & MC_CGM_MUX_10_DC_0_DE_MASK) != 0U)
    {
        switch (CLOCK_MUX_CSS_REG(10U) & MC_CGM_MUX_10_CSS_SELSTAT_MASK)
        {
            case MC_CGM_MUX_10_CSS_SELSTAT(CLOCK_FIRC_CLK):
                freq = CLOCK_GetFircClkFreq();
                break;
            case MC_CGM_MUX_10_CSS_SELSTAT(CLOCK_FXOSC_CLK):
                freq = CLOCK_GetFxoscFreq();
                break;
            case MC_CGM_MUX_10_CSS_SELSTAT(CLOCK_PLL_PHI1_CLK):
                freq = CLOCK_GetPllPhiClkFreq(1U);
                break;
            default:
                break;
        }

        freq /= ((CLOCK_MUX_DC_REG(10U, 0U) & MC_CGM_MUX_10_DC_0_DIV_MASK) >> MC_CGM_MUX_10_DC_0_DIV_SHIFT) + 1U;
    }
    else
    {
        freq = 0U;
    }

    return freq;
}
#endif

