zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/drivers/fsl_clock.c
uint32_t CLOCK_GetFlexcanPeClkFreq(uint32_t index)
{
    uint32_t freq = 0U;
    assert(index < 6U);
    if (index < 3U)
    {
        if ((MC_CGM->MUX_3_DC_0 & MC_CGM_MUX_3_DC_0_DE_MASK) != 0U)
        {
            switch (MC_CGM->MUX_3_CSS & MC_CGM_MUX_3_CSS_SELSTAT_MASK)
            {
                case MC_CGM_MUX_3_CSS_SELSTAT(CLOCK_FIRC_CLK):
                    freq = CLOCK_GetFircClkFreq();
                    break;
                case MC_CGM_MUX_3_CSS_SELSTAT(CLOCK_FXOSC_CLK):
                    freq = CLOCK_GetFxoscFreq();
                    break;
                case MC_CGM_MUX_3_CSS_SELSTAT(CLOCK_AIPS_PLAT_CLK):
                    freq = CLOCK_GetAipsPlatClkFreq();
                    break;
                default:
                    break;
            }

            freq /= ((MC_CGM->MUX_3_DC_0 & MC_CGM_MUX_3_DC_0_DIV_MASK) >> MC_CGM_MUX_3_DC_0_DIV_SHIFT) + 1U;
        }
        else
        {
            freq = 0U;
        }
    }
#if defined(FSL_FEATURE_MC_CGM_HAS_MUX_4) && (FSL_FEATURE_MC_CGM_HAS_MUX_4 != 0U)
    else
    {
        if ((MC_CGM->MUX_4_DC_0 & MC_CGM_MUX_4_DC_0_DE_MASK) != 0U)
        {
            switch (MC_CGM->MUX_4_CSS & MC_CGM_MUX_4_CSS_SELSTAT_MASK)
            {
                case MC_CGM_MUX_4_CSS_SELSTAT(CLOCK_FIRC_CLK):
                    freq = CLOCK_GetFircClkFreq();
                    break;
                case MC_CGM_MUX_4_CSS_SELSTAT(CLOCK_FXOSC_CLK):
                    freq = CLOCK_GetFxoscFreq();
                    break;
                case MC_CGM_MUX_4_CSS_SELSTAT(CLOCK_AIPS_PLAT_CLK):
                    freq = CLOCK_GetAipsPlatClkFreq();
                    break;
                default:
                    break;
            }
            freq /= ((MC_CGM->MUX_4_DC_0 & MC_CGM_MUX_4_DC_0_DIV_MASK) >> MC_CGM_MUX_4_DC_0_DIV_SHIFT) + 1U;
        }
        else
        {
            freq = 0U;
        }
    }
#endif /* FSL_FEATURE_MC_CGM_HAS_MUX_4 */

    return freq;
}

uint32_t CLOCK_GetFreq(clock_name_t name)
{
    uint32_t freq = 0U;

    switch (name)
    {
        case kCLOCK_CoreSysClk:
        case kCLOCK_Adc0Clk:
        case kCLOCK_Adc1Clk:
#if defined(FSL_FEATURE_SOC_ADC_COUNT) && (FSL_FEATURE_SOC_ADC_COUNT > 2U)
        case kCLOCK_Adc2Clk:
#endif /* FSL_FEATURE_SOC_ADC_COUNT */
        case kCLOCK_BctuClk:
        case kCLOCK_EmiosClk:
        case kCLOCK_FlexioClk:
            freq = CLOCK_GetCoreClkFreq();
            break;
        case kCLOCK_AipsPlatClk: /* AIPS_PLAT_CLK*/
        case kCLOCK_Lpspi0Clk:
        case kCLOCK_Lpuart0Clk:
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 8U)
        case kCLOCK_Lpuart8Clk:
#endif /* FSL_FEATURE_SOC_LPUART_COUNT */
            freq = CLOCK_GetAipsPlatClkFreq();
            break;
        case kCLOCK_AipsSlowClk: /* AIPS_SLOW_CLK */
        case kCLOCK_Cmp0Clk:
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT > 1U)
        case kCLOCK_Cmp1Clk:
#endif /* FSL_FEATURE_SOC_LPCMP_COUNT */
#if defined(FSL_FEATURE_SOC_LPCMP_COUNT) && (FSL_FEATURE_SOC_LPCMP_COUNT > 2U)
        case kCLOCK_Cmp2Clk:
#endif /* FSL_FEATURE_SOC_LPCMP_COUNT */
        case kCLOCK_Lpi2c0Clk:
        case kCLOCK_Lpi2c1Clk:
        case kCLOCK_Lpspi1Clk:
        case kCLOCK_Lpspi2Clk:
        case kCLOCK_Lpspi3Clk:
#if defined(FSL_FEATURE_SOC_LPSPI_COUNT) && (FSL_FEATURE_SOC_LPSPI_COUNT > 4U)
        case kCLOCK_Lpspi4Clk:
        case kCLOCK_Lpspi5Clk:
#endif /* FSL_FEATURE_SOC_LPSPI_COUNT */
        case kCLOCK_Lpuart1Clk:
        case kCLOCK_Lpuart2Clk:
        case kCLOCK_Lpuart3Clk:
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 4U)
        case kCLOCK_Lpuart4Clk:
        case kCLOCK_Lpuart5Clk:
        case kCLOCK_Lpuart6Clk:
        case kCLOCK_Lpuart7Clk:
#endif /* FSL_FEATURE_SOC_LPUART_COUNT */
#if defined(FSL_FEATURE_SOC_LPUART_COUNT) && (FSL_FEATURE_SOC_LPUART_COUNT > 8U)
        case kCLOCK_Lpuart9Clk:
        case kCLOCK_Lpuart10Clk:
        case kCLOCK_Lpuart11Clk:
        case kCLOCK_Lpuart12Clk:
        case kCLOCK_Lpuart13Clk:
        case kCLOCK_Lpuart14Clk:
        case kCLOCK_Lpuart15Clk:
#endif /* FSL_FEATURE_SOC_LPUART_COUNT */
        case kCLOCK_Pit0Clk:
        case kCLOCK_Pit1Clk:
#if defined(FSL_FEATURE_SOC_PIT_COUNT) && (FSL_FEATURE_SOC_PIT_COUNT > 2U)
        case kCLOCK_Pit2Clk:
#endif /* FSL_FEATURE_SOC_PIT_COUNT */
#if defined(FSL_FEATURE_SOC_I2S_COUNT) && (FSL_FEATURE_SOC_I2S_COUNT != 0U)
        case kCLOCK_Sai0Clk:
        case kCLOCK_Sai1Clk:
#endif /* FSL_FEATURE_SOC_I2S_COUNT */
            freq = CLOCK_GetAipsSlowClkFreq();
            break;
        case kCLOCK_HseClk:
            freq = CLOCK_GetHseClkFreq();
            break;
        case kCLOCK_DcmClk:
            freq = CLOCK_GetDcmClkFreq();
            break;
#if defined(FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV) && (FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV != 0U)
        case kCLOCK_LbistClk:
            freq = CLOCK_GetLbistClkFreq();
            break;
#endif /* FSL_FEATURE_MC_CGM_HAS_LBIST_CLK_DIV */
#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI != 0U)
        case kCLOCK_QspiClk:
            freq = CLOCK_GetQspiClkFreq();
            break;
#endif /* FSL_FEATURE_CLOCK_HAS_QSPI */
        case kCLOCK_FircClk:
            freq = CLOCK_GetFircClkFreq();
            break;
        case kCLOCK_SircClk:
            freq = CLOCK_SIRC_CLK_FREQ;
            break;
        case kCLOCK_FxoscClk:
            freq = CLOCK_GetFxoscFreq();
            break;
#if defined(FSL_FEATURE_MC_CGM_HAS_SXOSC) && (FSL_FEATURE_MC_CGM_HAS_SXOSC != 0U)
        case kCLOCK_SxoscClk:
            freq = CLOCK_GetSxoscFreq();
            break;
#endif /* FSL_FEATURE_MC_CGM_HAS_SXOSC */
        case kCLOCK_PllPhi0Clk:
            freq = CLOCK_GetPllPhiClkFreq(0U);
            break;
        case kCLOCK_PllPhi1Clk:
            freq = CLOCK_GetPllPhiClkFreq(1U);
            break;
        case kCLOCK_Flexcan0Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(0);
            break;
        case kCLOCK_Flexcan1Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(1);
            break;
        case kCLOCK_Flexcan2Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(2);
            break;
#if defined(FSL_FEATURE_SOC_FLEXCAN_COUNT) && (FSL_FEATURE_SOC_FLEXCAN_COUNT > 3U)
        case kCLOCK_Flexcan3Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(3);
            break;
        case kCLOCK_Flexcan4Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(4);
            break;
        case kCLOCK_Flexcan5Clk:
            freq = CLOCK_GetFlexcanPeClkFreq(5);
            break;
#endif /* FSL_FEATURE_SOC_FLEXCAN_COUNT > 3U */
        case kCLOCK_Stm0Clk:
            freq = CLOCK_GetStmClkFreq(0U);
            break;
#if defined(FSL_FEATURE_SOC_STM_COUNT) && (FSL_FEATURE_SOC_STM_COUNT == 2U)
        case kCLOCK_Stm1Clk:
            freq = CLOCK_GetStmClkFreq(1U);
            break;
#endif /* FSL_FEATURE_SOC_STM_COUNT == 2U */
#if defined(FSL_FEATURE_CLOCK_HAS_QSPI) && (FSL_FEATURE_CLOCK_HAS_QSPI > 0U)
        case kCLOCK_QspiSfClk:
            freq = CLOCK_GetQspiSfckFreq();
            break;
#endif /* FSL_FEATURE_CLOCK_HAS_QSPI */
        default:
            freq = 0U;
    }

    return freq;
}
